psytraxx/esp32h2-matter-plug/sdkconfig.defaults
# sdkconfig defaults for the Seeed XIAO ESP32-C6 (ESP32-C6, 4 MB flash,
# no PSRAM) replacing the CB2S module in a Tuya BL0937 energy-metering plug.
# Lifted from the sibling esp32c6-radar-demo-matter project's sdkconfig.defaults
# (same target, same Thread-only transport) with device identity and cluster
# selection changed for this plug.

# Target / flash / partition table
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# System
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_MBEDTLS_HKDF_C=y

# Size optimisation
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=n

# CPU frequency: 80 MHz saves power (Matter stack is not CPU-bound).
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80

# BLE (commissioning only)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1
CONFIG_BT_NIMBLE_MAX_CCCDS=4
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=16
CONFIG_BT_NIMBLE_TRANSPORT_EVT_DISCARD_COUNT=4
# Matter over Thread (BLE commissioning only).
# Thread is the operational transport; BLE is torn down once the device joins a fabric.

# Disable Wi-Fi — this board is Thread-only, even though the CB2S module it
# replaces was Wi-Fi. These keys turn off Matter's use of Wi-Fi so the CHIP
# stack no longer falls back to a (failing) Wi-Fi station connection loop.
# Note: the IDF Wi-Fi driver itself cannot be dropped from the link here —
# CONFIG_ESP_WIFI_ENABLED is a non-prompt symbol hardwired to y for any SoC
# with a Wi-Fi radio, so there is no sdkconfig switch to compile it out.
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ENABLE_WIFI_AP=n

# Thread / OpenThread (FTD — Full Thread Device, always on, no ICD/sleep).
# This is a mains-powered plug, so it stays awake and routes for the mesh
# rather than sleeping between polls — a sleepy end device would add up to a
# full poll interval of latency before the relay reacted to a controller
# command, the wrong trade for a switch. Deliberately NOT the nRF sibling
# project's OPENTHREAD_MTD + CHIP_ENABLE_ICD_SUPPORT: that build shares a
# codebase with a battery-minded sample and its power model does not apply
# here. Requires a Thread Border Router on the network to commission.
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_FTD=y

# lwIP / IPv6-only networking — Thread is IPv6-only, so the IPv4 stack is
# dropped to save flash/RAM.
CONFIG_LWIP_IPV4=n
CONFIG_DISABLE_IPV4=y
CONFIG_LWIP_ND6=n
CONFIG_LWIP_IPV6_AUTOCONFIG=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# Power management: dynamic frequency scaling only. Light sleep is deliberately
# NOT enabled — the radio has to stay listening for a router, and mains power
# means there is nothing to save it for.
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Matter device identity
CONFIG_DEVICE_VENDOR_ID=0xFFF2
CONFIG_DEVICE_PRODUCT_ID=0x8004
CONFIG_DEFAULT_DEVICE_HARDWARE_VERSION=1
CONFIG_USE_TEST_SERIAL_NUMBER="CB2SPLUG-0001"
# Per-build pairing code (discriminator + passcode + spake2p verifier) — edit
# main/chip_project_config.h before flashing to give each device its own code.
# Deliberately different from both sibling projects' discriminators so all
# three can be commissioned onto the same fabric at once.
CONFIG_CHIP_PROJECT_CONFIG="main/chip_project_config.h"
CONFIG_ENABLE_COMMISSIONABLE_DEVICE_TYPE=y
# Device type 0x010A = On/Off Plug-in Unit (root endpoint placeholder; the
# real device type lives on the dynamic endpoint created in matter_setup.cpp).
CONFIG_DEVICE_TYPE=266
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=8

# Disable unused Matter clusters to save flash
CONFIG_SUPPORT_CLOSURE_CONTROL_CLUSTER=n
CONFIG_SUPPORT_CLOSURE_DIMENSION_CLUSTER=n
CONFIG_SUPPORT_GROUPCAST_CLUSTER=n
CONFIG_ESP_INSIGHTS_ENABLED=n

# No display — pairing code is printed to the serial console only (see
# run_commissioning() in app_main.cpp).
